tutorials/AC-DBD/old_cases/actuator/AC-DBD/3D/Svarnas2021_baffleEle/flow/constant/fvOptions_notinuse
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/heater";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    scalarSource
    {
        type            scalarSemiImplicitSource;
        selectionMode   cellSet;
        cellSet         Kinjection;

        volumeMode      absolute;

        injectionRateSuSp
        {
            k          (100.0 0);
        }
    }
}

// ************************************************************************* //
